Revit 2027 API
ConnectorElement.AssignAsPrimary Method
 Assign a connector as a primary connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AssignAsPrimary()
Public Sub AssignAsPrimary
public:
void AssignAsPrimary()
member AssignAsPrimary : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when fail to assign this connector as primary.
Remarks
 This method is used to promote this connector as primary, and the rest of connectors in this system will be assigned as secondary.
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace